#+TITLE: Readme

created the project under $GOPATH

*** Sort a list with the given arbitrary inputs
Not working, but in progres 2 5 3 4

#+begin_src go
import "fmt"
type P struct {
    x string
	y int
}
func main() {
	b := P{"x", -1}
	a := [...]P{P{"a", 10},
        P{"b", 2},
        P{"c", 3}}
	for _, z := range a {
		if z.y > b.y {
			b = z
		}
	}
	fmt.Println(b.x)
}
#+end_src

#+RESULTS:
: a

#+begin_src go
import "fmt"
func main() {
	s := make([]int, 0, 3)
	s = append(s, 100)
	fmt.Println(len(s), cap(s))
}

#+end_src

#+RESULTS:
: 1 3
***** Example
#+begin_src go :tangle ~/go/src/github.com/BuddhiLW/ProgInGo/Week4/json.go
package main

import (
	"encoding/json"
	"fmt"
)

type Person struct {
	name  string
	addr  string
	phone string
}

func main() {
	p1 := Person{name: "joe", addr: "a st.", phone: "123"}

	barr, err := json.Marshal(p1)
	fmt.Println(err)
	fmt.Println("byte array (barr):", barr, "\t person 1 (p1) in Go:", p1)

	var p2 Person
	err2 := json.Unmarshal(barr, &p2)
	fmt.Println("person 2 (p2) in Go:", p2, "error:", err2)
}
#+end_src

#+RESULTS:
: <nil>
: byte array (barr): [123 125] 	 person 1 (p1) in Go: {joe a st. 123}
: person 2 (p2) in Go: {  } error: <nil>

#+begin_src go
package main

import (
    "encoding/json"
    "fmt"
)

type Person struct {
    Name  string `json:"name"`
    Addr  string `json:"addr"`
    Phone string `json:"phone"`
}

func main() {
    p1 := Person{Name: "joe", Addr: "a st.", Phone: "123"}

    barr, err := json.Marshal(p1)
    if err != nil {
        panic(err)
    }
    fmt.Println(string(barr))

	var p2 Person
	err2 := json.Unmarshal(barr, &p2)
	fmt.Println("person 2 (p2) in Go:", p2, "error:", err2)
}
#+end_src
**** Assignment 1
#+begin_src go :tangle ~/go/src/github.com/BuddhiLW/ProgInGo/Week4/assignment4.go
package main

import (
	"encoding/json"
	"fmt"
)

type Person struct {
	Name  string `json:"name"`
	Address  string `json:"address"`
}

func main() {
	var x string
	fmt.Println("Enter 'Name':")
	_, _ = fmt.Scan(&x)

	var y string
	fmt.Println("Enter 'Address':")
	_, _ = fmt.Scan(&y)

	p1 := Person{Name: x, Address: y}

	barr, err := json.Marshal(p1)
	if err != nil {
		panic(err)
	}
	fmt.Println(string(barr))
}
#+end_src

#+RESULTS:
: Enter 'Name':
: Enter 'Address':
: {"name":"","address":""}
A casa azul foi invadida por monges budistas literados em artes furtivas.
Segundo os conquistadores, ser maraja não é flores.
Segundo os ultrajados, sua conquista é não ser conquistado.
Há aqueles os quais orgulham-se de se orgulhar.
Há aqueles os quais a única coisa a qual os resta é orgulho.

**** Variables as Functions
Declaring a =func= as =var=
#+begin_src go
import "fmt"

var funVar func(int) int
func incFn(x int) int {
	return x+1
}

func main (){
	funVar = incFn
	fmt.Println(funVar(1))
	fmt.Println(incFn)
}
#+end_src

#+RESULTS:
: 2
: 0x47df40

**** As =arg=
#+begin_src go
import "fmt"

var funVar func(int) int
func incFn(x int) int {
	return x+1
}

func applyIt(f func (int) int, x int) int {
	return f(x)
}

func main (){
	funVar = incFn
	fmt.Println(funVar(1))
	fmt.Println(incFn)
	fmt.Println(applyIt(incFn,1))
	fmt.Println(applyIt(incFn,(applyIt(incFn,1))))
}
#+end_src

#+RESULTS:
: 2
: 0x47df40
: 2
: 3
**** Anonymous Function
#+begin_src go
import "fmt"

var funVar func(int) int
func incFn(x int) int {
	return x+1
}

func applyIt(f func (int) int, x int) int {
	return f(x)
}

func main (){
	funVar = incFn
	fmt.Println(funVar(1))
	fmt.Println(incFn)
	fmt.Println(applyIt(incFn,1))
	fmt.Println(applyIt(incFn,(applyIt(incFn,1))))

	v:= applyIt(func (x int) int {return x+4}, 1)
	fmt.Println(v)
}

#+end_src

#+RESULTS:
: 2
: 0x47df40
: 2
: 3
: 5

***** Go
The package environment has the same property that the =Class= environment in Python.

- =Data-fields= are called "=receiver-type=".
- =Methods= receive =receiver-types= in Go.
- =Methods= only operates on types declared on the package's environment they
  are in.
- Data is passed implicitly to =Methods=.

#+begin_src go
import "fmt"

type MyInt int

func (mi MyInt) MyMethod () int {
	return int(mi + 1)
}

func main (){
	var x MyInt
	x = 10
	fmt.Println(x.MyMethod())
}
#+end_src

#+RESULTS:
: 11

***** Example

#+begin_src go
import (
	"fmt"
	"math"
)

type Point struct {
	x float64
	y float64
}

func (p Point) DistToOrig() float64 {
	t := math.Pow(p.x,2) + math.Pow(p.y,2)
	return math.Sqrt(t)
}

func main () {
	p := Point{x: 1.3, y: (-1 * math.Pi)}
	fmt.Println(p.DistToOrig())
}
#+end_src

#+RESULTS:
: 3.399941823191885
***** Call by reference
#+begin_src go
import "fmt"

type MyIntBR struct {
	x float64
	y float64
}

type MyIntBV struct {
	x float64
	y float64
}

func (mi *MyIntBR) MyMethodBR (xx,yy float64) {
	mi.x = mi.x + xx + 1
	mi.y = mi.y + yy + 2
}

func (mi MyIntBV) MyMethodBV (xx,yy float64) (float64,float64){
	return (mi.x + xx + 1), (mi.y + yy + 2)
}

func main (){
	fmt.Println("With Call By Reference:")

	var z MyIntBR
	z = MyIntBR{x: 10, y: 22}
	fmt.Println(z.x, z.y)
	z.MyMethodBR(10,22)
	fmt.Println(z.x, z.y)

	fmt.Println("With Call By Value:")
	var w MyIntBV
	w = MyIntBV{x: 10, y: 22}
	w.MyMethodBV(99, 299)
	fmt.Println(w.x, w.y)
	wx, wy := w.MyMethodBV(10,22)
	fmt.Println(wx, wy)
}
#+end_src

#+RESULTS:
: With Call By Reference:
: 10 22
: 21 46
: With Call By Value:
: 10 22
: 21 46
